"""
7. Написати скрипт, який отримає максимальне і мінімальне значення із словника. Дані захардкодити.
                Приклад словника (можете використовувати свій):
                dict_1 = {1: 10, 2: 20, 3: 30, 4: 40, 5: 50, 6: 60}
                Вихідний результат:
                MIN: 10
                MAX: 60
"""
dict_1 = {1: 65, 2: 22, 3: 30, 4: 40, 5: 50, 6: 60}
minimum = min(dict_1.values())
maximum = max(dict_1.values())
print("MIN:", minimum)
print("MAX:", maximum)


